; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v2)
             (pred_5 ?v3 ?v9)
             (pred_4 ?v10 ?v9)
             (pred_8 ?v13 ?v10 )
	     (pred_1 ?v10)
             (pred_12 ?v5)
             (pred_6 ?v3)
             (pred_9 ?v9)
             (pred_7 ?v10)
             (pred_3 ?v3)
             (pred_11 ?v10)
             (pred_10 ))



(:action op_4
:parameters (?v11 ?v12 ?v1 ?v8)
:precondition (and (pred_12 ?v11) (pred_12 ?v12) (pred_6 ?v1) (pred_9 ?v8)
          (pred_2 ?v11 ?v12) (pred_5 ?v1 ?v8)
                   (pred_4 ?v12 ?v8) (pred_1 ?v11) 
                   (pred_7 ?v12) (pred_3 ?v1))
:effect (and  (pred_11 ?v12) (not (pred_7 ?v12))))


(:action op_5
:parameters (?v11 ?v7)
:precondition (and (pred_12 ?v11) (pred_12 ?v7)
               (pred_1 ?v11) (pred_2 ?v11 ?v7) (pred_11 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v11))))

(:action op_3
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_6 ?v1) 
                  (pred_1 ?v11) (pred_8 ?v1 ?v11) (pred_10 ))
:effect (and (pred_3 ?v1)
   (not (pred_8 ?v1 ?v11)) (not (pred_10 ))))


(:action op_2
:parameters (?v11 ?v4 ?v6)
:precondition (and (pred_12 ?v11) (pred_6 ?v4) (pred_6 ?v6)
                  (pred_1 ?v11) (pred_3 ?v6) (pred_8 ?v4 ?v11))
:effect (and (pred_3 ?v4) (pred_8 ?v6 ?v11)
        (not (pred_3 ?v6)) (not (pred_8 ?v4 ?v11))))

(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_6 ?v1) 
                  (pred_1 ?v11) (pred_3 ?v1))
:effect (and (pred_10 ) (pred_8 ?v1 ?v11) (not (pred_3 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_01 obj_12 obj_09 obj_19 obj_16 obj_08 obj_21 obj_17 obj_04 obj_15 obj_20 obj_03 obj_11 obj_06 obj_14
    obj_13 obj_02
    obj_07 obj_05 obj_18
    )

    (:init
       (pred_10)

       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_08)
       (pred_12 obj_21)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_9 obj_13)
       (pred_9 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_18)

       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_06)
       (pred_7 obj_04)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_4  obj_04 obj_13)
       (pred_4  obj_17 obj_02)
       (pred_4  obj_19 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_08)
       (pred_11 obj_21)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_11 obj_06)
       (pred_11 obj_14)

       (pred_5  obj_07 obj_13)
       (pred_5  obj_05 obj_02)
       (pred_5  obj_18 obj_13)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_18 obj_06)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_8 obj_18 obj_08)
    ))
(:constraints
  (always (not (pred_1 obj_15)))
)
)

; plan
1. (op_5 obj_16 obj_08)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_21)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_21)
   goals met: 0 of 1
3. (op_5 obj_21 obj_20)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_20)
   goals met: 0 of 1
4. (op_5 obj_20 obj_14)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_14)
   goals met: 0 of 1
5. (op_5 obj_14 obj_06)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_06)
   goals met: 0 of 1
6. (op_3 obj_06 obj_18)
   deleted: (pred_8 obj_18 obj_06) (pred_10)
   added: (pred_3 obj_18)
   goals met: 0 of 1
7. (op_5 obj_06 obj_14)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_20)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_20)
   goals met: 0 of 1
9. (op_5 obj_20 obj_21)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_21)
   goals met: 0 of 1
10. (op_5 obj_21 obj_08)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_08)
   goals met: 0 of 1
11. (op_1 obj_08 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_10) (pred_8 obj_18 obj_08)
   goals met: 1 of 1
